[
    {
      "term": "Quality Improvement (QI)",
      "definition": "A systematic, data-guided activity designed to bring about immediate improvements in health care delivery and outcomes."
    },
    {
      "term": "Patient Safety",
      "definition": "The prevention of errors and adverse effects to patients associated with health care."
    },
    {
      "term": "Adverse Event",
      "definition": "An injury caused by medical management rather than the underlying condition of the patient."
    },
    {
      "term": "Near Miss",
      "definition": "An event that could have caused harm to a patient but did not, either by chance or timely intervention."
    },
    {
      "term": "Root Cause Analysis (RCA)",
      "definition": "A structured method used to analyze serious adverse events to identify underlying problems that increase the likelihood of errors."
    },
    {
      "term": "Plan-Do-Study-Act (PDSA) Cycle",
      "definition": "An iterative, four-stage problem-solving model used to test changes and improve processes."
    },
    {
      "term": "Benchmarking",
      "definition": "Comparing performance metrics to best practices from other organizations to identify areas for improvement."
    },
    {
      "term": "Clinical Governance",
      "definition": "A framework through which health care organizations are accountable for continuously improving service quality and safeguarding high standards of care."
    },
    {
      "term": "Failure Mode and Effects Analysis (FMEA)",
      "definition": "A proactive method for evaluating a process to identify where and how it might fail and to assess the relative impact of different failures."
    },
    {
      "term": "Human Factors Engineering",
      "definition": "The study of how people interact with systems and devices, used to design safer and more efficient processes."
    },
    {
      "term": "Just Culture",
      "definition": "An organizational culture that balances accountability with a non-punitive approach to error reporting and learning."
    },
    {
      "term": "Safety Culture",
      "definition": "The shared values, attitudes, and behaviors that determine the commitment to health and safety management in an organization."
    },
    {
      "term": "Incident Reporting",
      "definition": "A system for reporting and analyzing events that did or could have resulted in harm to patients."
    },
    {
      "term": "Standard Operating Procedure (SOP)",
      "definition": "A detailed, written instruction designed to achieve uniformity in performing specific functions."
    },
    {
      "term": "Evidence-Based Practice (EBP)",
      "definition": "The conscientious integration of best research evidence, clinical expertise, and patient values in decision making about care."
    },
    {
      "term": "Key Performance Indicator (KPI)",
      "definition": "A measurable value that indicates how effectively an organization is achieving key objectives."
    },
    {
      "term": "Lean Methodology",
      "definition": "An approach focused on minimizing waste and maximizing value in processes."
    },
    {
      "term": "Six Sigma",
      "definition": "A data-driven method for improving quality by identifying and removing the causes of defects and minimizing variability."
    },
    {
      "term": "Process Mapping",
      "definition": "A visual representation of the steps involved in a process to identify areas for improvement."
    },
    {
      "term": "Continuous Quality Improvement (CQI)",
      "definition": "An ongoing effort to improve products, services, or processes through incremental and breakthrough improvements."
    },
    {
      "term": "Handoff Communication",
      "definition": "The transfer of essential patient information and responsibility between caregivers to ensure continuity and safety of care."
    },
    {
      "term": "Sentinel Event",
      "definition": "A patient safety event that results in death, permanent harm, or severe temporary harm, and signals a need for immediate investigation and response."
    },
    {
      "term": "High Reliability Organization (HRO)",
      "definition": "An organization that operates in complex, high-risk environments yet maintains a superior safety record through mindfulness and resilience."
    },
    {
      "term": "Risk Management",
      "definition": "The process of identifying, assessing, and controlling threats to an organization's capital and earnings, including patient harm."
    },
    {
      "term": "Safety Netting",
      "definition": "Providing patients with clear guidance on what to do if their condition does not improve, ensuring ongoing safety after an encounter."
    },
  {
    "term": "Patient Engagement",
    "definition": "The active involvement of patients in their own care to improve outcomes and safety."
  },
  {
    "term": "Trigger Tool",
    "definition": "A method for identifying possible adverse events in patient records using specific 'triggers' or clues."
  },
  {
    "term": "Handoff Communication",
    "definition": "The transfer of essential patient information during transitions in care to ensure continuity and safety."
  },
  {
    "term": "ISBAR",
    "definition": "A structured communication tool that stands for Identify, Situation, Background, Assessment, and Recommendation."
  },
  {
    "term": "TeamSTEPPS",
    "definition": "A teamwork system designed for healthcare professionals to improve communication and teamwork skills for patient safety."
  },
  {
    "term": "Time Out",
    "definition": "A deliberate pause before a procedure to confirm patient identity, procedure, and site to prevent errors."
  },
  {
    "term": "Error of Commission",
    "definition": "A safety event resulting from doing something wrong, such as giving the wrong medication."
  },
  {
    "term": "Error of Omission",
    "definition": "A safety event resulting from failing to do the right thing, such as not giving a necessary medication."
  },
      {
    "term": "Safety Huddle",
    "definition": "A brief, focused meeting of a care team to discuss safety concerns, plan care, and identify risks."
  },
  {
    "term": "Never Event",
    "definition": "A serious incident that is entirely preventable if proper safety measures are in place, such as surgery on the wrong site."
  },
  {
    "term": "Process Map",
    "definition": "A visual representation of the steps in a process to identify bottlenecks, waste, or opportunities for improvement."
  },
  {
    "term": "Fishbone Diagram",
    "definition": "A cause-and-effect diagram used to identify, explore, and display the possible causes of a specific problem."
  },
  {
    "term": "Checklists",
    "definition": "Structured tools used to ensure critical steps are not missed in clinical processes, improving consistency and reliability."
  },
  {
    "term": "Hand Hygiene",
    "definition": "A key infection prevention practice involving proper cleaning of hands to reduce the transmission of pathogens."
  },
  {
    "term": "Clinical Audit",
    "definition": "A systematic review of care against explicit criteria and implementation of change where necessary to improve patient outcomes."
  }
  ]
